tutorials/incompressible/overPimpleDyMFoam/simpleRotor/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.2;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(walls|hole)"
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

//    left1
//    {
//        type            turbulentIntensityKineticEnergyInlet;
//        intensity       0.05;       // 5% turbulent intensity
//        value           $internalField;
//    }
//
//    right1
//    {
//        type            calculated;
//        value           $internalField;
//    }

    overset
    {
        type            overset;
    }
}

// ************************************************************************* //
